[Killed] StringLiteral
sd-05-block15-project-react-testing-library/src/components/Pokedex.js:50:12
           onClick={() => this.filterPokemons('all')}
           className="filter-button"
         >
-          {`All`}
+          {""}
         </Button>
         {pokemonTypes.map((type) => (

[Killed] StringLiteral
sd-05-block15-project-react-testing-library/src/components/Pokedex.js:86:12
           onClick={() => this.nextPokemon(filteredPokemons.length)}
           disabled={filteredPokemons.length <= 1}
         >
-          {`Próximo pokémon`}
+          {""}
         </Button>
       </div>
